export type TrainingSession = {
  name: string;
  exercises: string[];
};

export type TrainingProgram = {
  muscleGroup: string;
  sessions: TrainingSession[];
};

export const trainingPrograms: TrainingProgram[] = [
  {
    muscleGroup: "Спина",
    sessions: [
      {
        name: "Тренування 1",
        exercises: [
          "Станова тяга",
          "Тяга у верхньому блоці (Хаммер)",
          "Пулловер",
          "Тяга горизонтального блока",
          "Шраги",
        ],
      },
      {
        name: "Тренування 2",
        exercises: [
          "Тяга верхнього блока за голову",
          "Тяга Т-грифа широким хватом",
          "Тяга у верхньому блоці (Хаммер)",
          "Тяга верхнього блока до грудей",
          "Шраги",
        ],
      },
      {
        name: "Тренування 3",
        exercises: [
          "Підтягування",
          "Тяга у верхньому блоці (Хаммер)",
          "Тяга верхнього блока за голову",
          "Тяга горизонтального блока",
          "Шраги",
        ],
      },
      {
        name: "Тренировка 4",
        exercises: [
          "Тяга у верхньому блоці (Хаммер)",
          "Тяга штанги в наклоні зворотним хватом",
          "Підтягування",
          "Тяга горизонтального блока звичайним хватом",
          "Тяга верхнього блока за голову",
          "Шраги зі штангою",
        ],
      },
      {
        name: "Тренування 5",
        exercises: [
          "Тяга Т-грифа",
          "Суперсет: Пулловер у кроссовері та Тяга гантелі в наклоні",
          "Суперсет: Тяга у верхньому блоці (Хаммер) та Тяга верхнього блока до грудей",
          "Шраги",
        ],
      },
      {
        name: "Тренування 6",
        exercises: [
          "Підтягування",
          "Тяга гантелі в наклоні",
          "Тяга горизонтального блока",
          "Тяга верхнього блока до грудей",
          "Пулловер з прямим грифом у кроссовері",
          "Шраги",
        ],
      },
      {
        name: "Тренування 7",
        exercises: [
          "Тяга верхнього блока до грудей звичайним хватом",
          "Тяга у верхньому блоці (Хаммер)",
          "Тяга Т-грифа звичайним хватом",
          "Тяга горизонтального блока широким хватом",
          "Тяга верхнього блока за голову",
          "Шраги за спиною в тренажері Сміта",
        ],
      },
      {
        name: "Тренування 8",
        exercises: [
          "Тяга штанги до поясу в тренажері Сміта",
          "Тяга Т-грифа звичайним хватом",
          "Тяга верхнього блока до грудей",
          "Тяга у нижньому блоці (Хаммер)",
          "Пулловер широким хватом",
          "Шраги зі штангою",
        ],
      },
      {
        name: "Тренування 9",
        exercises: [
          "Станова тяга з підставок (до колін)",
          "Підтягування",
          "Тяга у верхньому блоці (Хаммер)",
          "Тяга у кроссовері до поясу",
          "Шраги зі штангою",
        ],
      },
      {
        name: "Тренування 10",
        exercises: [
          "Тяга гантелі в наклоні",
          "Тяга верхнього блока до грудей нейтральним хватом",
          "Тяга у верхньому блоці (Хаммер)",
          "Тяга Т-грифа",
          "Шраги зі штангою",
        ],
      },
      {
        name: "Тренування 11",
        exercises: [
          "Тяга гантелі в наклоні",
          "Тяга верхнього блока до грудей",
          "Тяга у нижньому блоці (Хаммер)",
          "Пулловер",
          "Шраги з гантелями",
        ],
      },
    ],
  },
  {
    muscleGroup: "Плечі",
    sessions: [
      {
        name: "Тренування 1",
        exercises: [
          "Жим гантелей сичи",
          "Тяга гирі до підборіддя",
          "Підйоми гантелей перед собою",
          "Зворотні розведення в тренажері (Бабочка)",
          "Бічні підйоми гантелей (Махи в сторони)",
        ],
      },
      {
        name: "Тренування 2",
        exercises: [
          "Зворотні розведення в тренажері (Бабочка)",
          "Жим штанги в тренажері Сміта",
          "Підйоми гантелей перед собою",
          "Бічні підйоми гантелей (Махи в сторони)",
          "Жим Арнольда",
        ],
      },
      {
        name: "Тренування 3",
        exercises: [
          "Жим гантелей сичи",
          "Швунг штанги з підлоги з подальшим жимом",
          "Тяга канатної рукояті на задню дельту",
          "Зворотні розведення в тренажері (Бабочка)",
          "Тяга EZ-грифа до підборіддя звичайним хватом",
          "Бічні підйоми гантелей (Махи в сторони)",
        ],
      },
      {
        name: "Тренування 4",
        exercises: [
          "Жим штанги з-за голови сичи в тренажері Сміта",
          "Підйом EZ-грифа перед собою",
          "Тяга широкого грифа в тренажері Сміта",
          "Бічні підйоми гантелей (Махи в сторони)",
          "Зворотні розведення в тренажері (Бабочка)",
        ],
      },
      {
        name: "Тренування 5",
        exercises: [
          "Жим штанги перед собою та з-за голови",
          "Тяга прямого грифа до підборіддя",
          "Бічні підйоми гантелей (Махи в сторони)",
          "Жим гантелей сичи",
          "Зворотні розведення в тренажері (Бабочка)",
        ],
      },
      {
        name: "Тренування 6",
        exercises: [
          "Зворотні розведення в тренажері (Бабочка)",
          "Поперемінні підйоми гантели перед собою",
          "Тяга широкого грифа до грудей",
          "Жим гантелей сичи",
          "Бічні підйоми гантелей (Махи в сторони)",
        ],
      },
      {
        name: "Тренування 7",
        exercises: [
          "Тяга штанги до грудей",
          "Тяга канатної рукояті",
          "Жим гантелей сичи",
          "Бічні підйоми гантелей (Махи в сторони)",
          "Розведення гантелей у наклоні на задню дельту",
        ],
      },
      {
        name: "Тренування 8",
        exercises: [
          "Суперсет: Тяга верхнього блока на задню дельту та Зворотні розведення в тренажері (Бабочка)",
          "Підйоми гантелей перед собою",
          "Тяга EZ-грифа до підборіддя",
          "Жим штанги стоя з-за голови",
          "Бічні підйоми гантелей (Махи в сторони)",
        ],
      },
      {
        name: "Тренування 9",
        exercises: [
          "Жим гантелей сичи",
          "Підйом EZ-грифа перед собою",
          "Зворотні розведення в тренажері (Бабочка)",
          "Тяга гирі до підборіддя",
          "Бічні підйоми гантелей (Махи в сторони)",
        ],
      },
      {
        name: "Тренування 10",
        exercises: [
          "Суперсет: Жим Арнольда та Підйоми блина перед собою",
          "Суперсет: Зворотні розведення в тренажері (Бабочка) та Тяга на задню дельту у кроссовері",
          "Суперсет: Бічні підйоми гантелей (Махи в сторони) та Тяга блина до підборіддя",
        ],
      },
    ],
  },
  {
    muscleGroup: "Руки",
    sessions: [
      {
        name: "Тренування 1",
        exercises: [
          "Підйом гантелей на біцепс із супінацією",
          "Підйом гантелей на біцепс на похилій лаві",
          "Підйом на біцепс з EZ-грифом",
          "Розгинання на трицепс у верхньому блоці (канатною рукояттю)",
          "Французький жим з прямим грифом",
          "Французький жим гантели з-за голови",
        ],
      },
      {
        name: "Тренування 2",
        exercises: [
          "Суперсет: Підйом на біцепс з EZ-грифом та Розгинання на трицепс у верхньому блоці",
          "Суперсет: Концентрований підйом на біцепс та Віджимання від лавки",
          "Суперсет: Підйом гантелей на біцепс 'Молот' та Розгинання на трицепс у верхньому блоці",
        ],
      },
    ],
  },
  {
    muscleGroup: "Ноги",
    sessions: [
      {
        name: "Тренування 1",
        exercises: [
          "Жим ногами в тренажері",
          "Розгинання ніг у тренажері",
          "Випади з гантелями",
          "Згинання ніг у тренажері",
        ],
      },
      {
        name: "Тренування 2",
        exercises: [
          "Присідання в тренажері Сміта",
          "Розгинання ніг у тренажері (по черзі)",
          "Жим ногами в тренажері",
          "Згинання ніг у тренажері",
        ],
      },
      {
        name: "Тренування 3",
        exercises: [
          "Присідання в тренажері Сміта",
          "Жим ногами в тренажері",
          "Розгинання ніг у тренажері",
          "Згинання ніг у тренажері",
        ],
      },
      {
        name: "Тренування 4",
        exercises: [
          "Розгинання ніг у тренажері (по черзі)",
          "Фронтальні присідання в тренажері Сміта",
          "Жим ногами в тренажері",
          "Згинання ніг у тренажері",
        ],
      },
    ],
  },
  {
    muscleGroup: "Груди",
    sessions: [
      {
        name: "Тренування 1",
        exercises: [
          "Жим штанги лежачи на горизонтальній лаві",
          "Зведення рук у тренажері (Бабочка)",
          "Жим гантелей лежачи на похилій лаві",
          "Віджимання на брусах",
          "Віджимання від підлоги",
        ],
      },
      {
        name: "Тренування 2",
        exercises: [
          "Зведення рук у тренажері (Бабочка)",
          "Жим гантелей лежачи",
          "Віджимання на брусах",
          "Розведення гантелей лежачи",
          "Скручування на прес",
        ],
      },
      {
        name: "Тренування 3",
        exercises: [
          "Жим гантелей лежачи з супінацією",
          "Зведення рук у тренажері (Бабочка)",
          "Жим штанги лежачи на похилій лаві",
          "Розведення гантелей лежачи",
          "Зведення рук у кроссовері",
        ],
      },
      {
        name: "Тренування 4",
        exercises: [
          "Зведення рук у кроссовері на похилій лаві",
          "Жим гантелей лежачи на горизонтальній лаві",
          "Зведення рук у тренажері (Бабочка)",
          "Жим штанги лежачи на похилій лаві",
          "Віджимання на брусах",
        ],
      },
      {
        name: "Тренування 5",
        exercises: [
          "Жим гантелей лежачи на похилій лаві",
          "Зведення рук у тренажері (Бабочка)",
          "Жим штанги лежачи на горизонтальній лаві",
          "Зведення рук у кроссовері (вниз)",
          "Віджимання на брусах",
          "Жим Свенда",
        ],
      },
      {
        name: "Тренування 6",
        exercises: [
          "Жим штанги лежачи на похилій лаві",
          "Розведення гантелей лежачи на горизонтальній лаві",
          "Жим гантелей лежачи з супінацією",
          "Віджимання на брусах",
          "Зведення рук у кроссовері",
          "Зведення рук у тренажері (Бабочка)",
        ],
      },
      {
        name: "Тренування 7",
        exercises: [
          "Жим штанги лежачи на горизонтальній лаві",
          "Розведення гантелей лежачи на похилій лаві",
          "Зведення рук у кроссовері",
          "Віджимання на брусах",
          "Зведення рук у тренажері (Бабочка)",
        ],
      },
      {
        name: "Тренування 8",
        exercises: [
          "Жим гантелей лежачи на похилій лаві",
          "Зведення рук у тренажері (Бабочка)",
          "Зведення рук у кроссовері",
          "Жим штанги лежачи",
          "Віджимання на брусах",
          "Віджимання від підлоги",
        ],
      },
      {
        name: "Тренування 9",
        exercises: [
          "Жим штанги лежачи на горизонтальній лаві",
          "Віджимання на брусах",
          "Жим гантелей лежачи на похилій лаві",
          "Зведення рук у тренажері (Бабочка)",
          "Розведення гантелей лежачи",
        ],
      },
      {
        name: "Тренування 10",
        exercises: [
          "Жим штанги в тренажері Сміта",
          "Зведення рук у тренажері (Бабочка)",
          "Зведення рук у кроссовері",
          "Розведення гантелей лежачи на горизонтальній лаві",
          "Жим гантелей лежачи на похилій лаві",
        ],
      },
      {
        name: "Тренування 11",
        exercises: [
          "Жим штанги на похилій лаві в тренажері Сміта",
          "Зведення рук у кроссовері на похилій лаві",
          "Віджимання на брусах",
          "Жим гантелей лежачи на горизонтальній лаві",
          "Зведення рук у кроссовері стоячи",
        ],
      },
      {
        name: "Тренування 12",
        exercises: [
          "Жим гантелей лежачи на похилій лаві",
          "Зведення рук у тренажері (Бабочка)",
          "Жим штанги лежачи на горизонтальній лаві",
          "Підйоми рук перед собою у кроссовері",
          "Жим Свенда",
        ],
      },
      {
        name: "Тренування 13",
        exercises: [
          "Жим штанги на похилій лаві в тренажері Сміта",
          "Розведення гантелей лежачи на горизонтальній лаві",
          "Жим гантелей лежачи з супінацією",
          "Віджимання на брусах",
          "Зведення рук у тренажері (Бабочка)",
          "Жим Свенда",
        ],
      },
      {
        name: "Тренування 14",
        exercises: [
          "Жим штанги лежачи на похилій лаві",
          "Розведення гантелей лежачи на горизонтальній лаві",
          "Зведення рук у кроссовері",
          "Віджимання на брусах",
          "Жим Свенда",
        ],
      },
    ],
  },
];
